n = 8
X = [1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0, 5.5, 6.0, 6.5, 7.0]
Y = [10.517, 10.193, 9.807, 9.387, 8.977, 8.637, 8.442, 8.482, 8.862, 9.701, 11.132, 13.302]

y1, y2, y3, y4, y5 = [], [], [], [], []

for i in range(n - 1):
    d_y1 = Y[i + 1] - Y[i]
    y1.append(d_y1)

for i in range(n - 2):
    d_y2 = y1[i + 1] - y1[i]
    y2.append(d_y2)

for i in range(n - 3):
    d_y3 = y2[i + 1] - y2[i]
    y3.append(d_y3)

for i in range(n - 4):
    d_y4 = y3[i + 1] - y3[i]
    y4.append(d_y4)

for i in range(n - 5):
    d_y5 = y4[i + 1] - y4[i]
    y5.append(d_y5)

print("\t", "X", " \t|", "\tY")
for i in range(n):
    print("\t", X[i], "\t|", Y[i])

xx = float(input("введіть значення аргумента x1: "))
h = X[i] - X[i - 1]
q = (xx - X[2]) / h

G = (y1[2] + y2[2] * (2 * q - 1) / 2 + y3[2] * (3 * (q ** 2) - 6 * q + 2) / 6 + y4[2] * (
            2 * (q ** 3) - 9 * (q ** 2) + 11 * q - 3) / 12) / h
print(f"Y`({xx}) = {G}")
G_2 = (y2[2] + y3[2] * (q - 1) + y4[2] * (6 * (q ** 2) - 18 * q + 11) / 12) / h ** 2
print(f"Y``({xx}) = {G_2}")

xx_2 = float(input("Введіть значення аргумента x2: "))
q2 = (xx_2 - X[7]) / h

F1 = (y1[6] + y2[5] * (2 * q2 + 1) / 2 + y3[4] * (3 * q2 * q2 + 6 * q2 + 2) / 6 +
      y4[3] * (2 * q2 * q2 * q2 + 9 * q2 * q2 + 11 * q2 + 3) / 12) / h

print(f"Y`({xx_2}) = {F1}")

F2 = (y2[5] + (q2 + 1) * y3[4] +
      y4[3] * (6 * (q2 ** 2) + 18 * q2 + 11) / 12) / h ** 2

print(f"Y``({xx_2}) = {F2}")
